[{"id":1,"img":"https://msatechnosoft.in/blog/wp-content/uploads/2018/09/Data-Structure-tutorial-MSA-Technosoft.jpg","code":"DS","course":"Data Structure","details":"A data structure is a specialized format for organizing, processing, retrieving and storing data. There are several basic and advanced types of data structures, all designed to arrange data to suit a specific purpose. Data structures make it easy for users to access and work with the data they need in appropriate ways.","rating":4.8,"instructor":"Seward Barnardo"},
{"id":2,"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTDNJNiODp38VK_KWegyF004htleqT1-6aWgg&usqp=CAU","code":"SP","course":"Structured Programming","details":"In structured programming, we sub-divide the whole program into small modules so that the program becomes easy to understand. The purpose of structured programming is to linearize control flow through a computer program so that the execution sequence follows the sequence in which the code is written. The dynamic structure of the program than resemble the static structure of the program. ","rating":3,"instructor":"Wadsworth Prandin"},
{"id":3,"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQYuNvzaLh08vGRy0q79ThJ0OQV1JD-DUzKyw&usqp=CAU","code":"DBMS","course":"Database Management System","details":"A database management system (DBMS) is system software for creating and managing databases. A DBMS makes it possible for end users to create, protect, read, update and delete data in a database. The most prevalent type of data management platform, the DBMS essentially serves as an interface between databases and users or application programs, ensuring that data is consistently organized and remains easily accessible.","rating":4.5,"instructor":"Vania Zammett"},
{"id":4,"img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRXK0tQbenwoEQpkgXmiBwQaNNtlV2DbiLwdA&usqp=CAU","code":"CN","course":"Computer Network","details":"An interconnection of multiple devices, also known as hosts, that are connected using multiple paths for the purpose of sending/receiving data or media. Computer networks can also include multiple devices/mediums which help in the communication between two different devices; these are known as Network devices and include things such as routers, switches, hubs, and bridges. ","rating":5,"instructor":"Xerxes Faldoe"},
{"id":5,"img":"https://image.slidesharecdn.com/tahrim-170301130548/85/peripheral-interfacing-2-320.jpg?cb=1666032138","code":"PI","course":"Peripheral and Interfaces","details":"A programmable peripheral interface is a multiport device. The ports may be programmed in a variety of ways as required by the programmer. The device is very useful for interfacing peripheral devices. The term PIA, Peripheral Interface Adapter is also used by some manufacturer.","rating":4.5,"instructor":"Betsey Tine"},
{"id":6,"img":"https://misti.mit.edu/sites/default/files/styles/hero_home_desktop/public/2022-03/human-like-robot-and-artificial-intelligence-2022-01-06-00-25-53-utc.jpg?h=67494091&itok=C7js1A7t","code":"AI","course":"Artificial Intelligence","details":"Artificial intelligence (AI) refers to the simulation of human intelligence in machines that are programmed to think like humans and mimic their actions. The term may also be applied to any machine that exhibits traits associated with a human mind such as learning and problem-solving.","rating":5,"instructor":"Tonya Krauss"}]